{
  "professional": [
    {
      "company": "Coda",
      "country": "Thailand 🇹🇭",
      "position": "Software Engineer",
      "startDate": "2025-12",
      "endDate": "Present",
      "highlights": [
        "Setup the foundational configuration for the Card Service, decoupling Tokenized Charge functionality into PCI-compliant and non-PCI modules to enhance security and maintainability.",
        "Ensured payment reliability by maintaining the automated test suite for Tokenized Charge, covering both 3DS and non-3DS card payment scenarios.",
        "Integrated Charge Intent API to handle tax-exclusive cases and signed new data into existing JWT",
        "Enhanced onboarding documentation by authoring the 'Dynamic Environment 101' handbook, clarifying the usage of personal developer workspaces to streamline new hire ramp-up.",
        "Established Java code formatting standards and implemented a uniform formatter to ensure code consistency and reduce code review friction."
      ]
    },
    {
      "company": "PayPay Card Corporation (Secondment)",
      "country": "Japan 🇯🇵",
      "position": "Backend Engineer (Payment Processing)",
      "startDate": "2025-04",
      "endDate": "2025-11",
      "highlights": [
        "Developed chargeback application system to handle dispute transactions and streamline the chargeback process for security center and card holder interactions. ",
        "Designed solution for idempotent frontend processor payment event before for passing it to transaction message by using combination between Kafka exactly_once_v2 process guarantee and put original message for recovery and investigation purpose. Fallback failure by sending it to dead letter topic (DLQ idea).",
        "Conducted scenarios testing for OTP case to ensure functionality result between cross-functional team",
        "Analyze greenfield codebase which communicate with external system by TCP connection. Created common library for handling serialize/deserialize byte array message to object and reuse across projects",
        "Initiated GitHub Actions to run E2E test for validating the payment processing flow before release"
      ]
    },
    {
      "company": "PayPay Corporation",
      "country": "Japan 🇯🇵",
      "position": "Backend Engineer (Growth Platform)",
      "startDate": "2022-09",
      "endDate": "2025-11",
      "highlights": [
        "Led the enhancement of a mission-critical campaign management platform to enable secure data handling within a dedicated support room, collaborating with cross-functional teams to ensure seamless integration with existing functionalities. Eliminated costly SMS communications, saving 3 million yen annually.",
        "Supported and mentored the sub-team to develop the new feature for marketing communication strategy systems",
        "Re-engineered PayPay's personalized asset delivery system, replacing a legacy multi-tenant Akka-based solution with a streamlined Spring Boot 3.2 (Kotlin) application utilizing coroutines and asynchronous caching. Achieved 8,000 RPS with minimal latency, exceeding the system's peak demand of 7,000 RPS, while eliminating 80% of dead code inherited from a previous Paytm implementation. Overcame performance bottlenecks by adopting Kotlin coroutines for a highly efficient asynchronous architecture. Resulting in monthly savings of 648,720 yen.",
        "Reduced infrastructure cost for $1500 by detected unused push silent service which were running on production and processed to remove them",
        "Noticed the FCM legacy API usage and migrated to Firebase Admin SDK approach to send to group of target device before the application cannot using push notification without further error.",
        "Introduced a plan for the multi-stage upgrade from Spring Boot 2.2 with JDK 8 to Spring Boot 3.3 with JDK 17. Ensured seamless transition and uninterrupted service delivery throughout the 3-month modernization process. Migrated the build system from Maven to Gradle and integrated the platform with PayPay's golden image to improve build efficiency, dependency management, and standardization.",
        "Spearheaded the architecture and development of high-throughput, low-latency push notification services handling 120+ million daily notifications for diverse PayPay use cases, including transactional and promotional campaigns.",
        "Led the migration of 36 Spark-Scala ETL jobs and 51 data lake tables to a new data lake, collaborating with the DaaS team to achieve a cost reduction of 548,000 yen daily (200 million yen annually).",
        "Collaborated across tech/non-tech teams, designed the timeline notification delivery system from scratch including drafting, functional/non-functional requirements, and implemented the workloads with Kotlin - Spring Boot, Spring WebFlux with the Cadence Workflow, and Kafka integration. As a result, Reduced 100 hours per month for the marketing team, unlocked capabilities for marketing team to create workflow during weekends, and Increased annual GMV by 4M JPY.",
        "Documented the procedure for production manual operation with readable format and easier to follow.",
        "Implemented APM on the legacy inherited Spring Boot microservice to able to have the capability of observing the microservice.",
        "Investigate the feasibility of implementing the approach for limiting the number of database connections and identifying the problem. Followed by optimizing the code change to use the connection pool configuration with HikariCP on the Spring Boot microservice. As a result, the application has a fixed-size pool and also increases the stability and reliability of the core microservice in the ecosystem.",
        "Implemented a Spark job for grouping the audience based on conditions for creating the campaign and audience with good documentation in Scala programming language. The results of the job are used for the marketing team to create a campaign and audience for the marketing campaign to increase GMV. For example, one job has increased GMV for 10M JPY per month.",
        "Analyzed and developed from the feasible investigation documentation in action by extending the lifetime of data and managing the workflow in Spring Boot and Cadence workflow. As a result, the new business can use the same system that exists used.",
        "Feasible investigation on the infrastructure and applications scaling impact for support of new business epic. Identify workload increasing as calculation memory usage based on current systems and provide points to make the technical changes."
      ]
    },
    {
      "company": "Accenture",
      "country": "Thailand 🇹🇭",
      "position": "Application Development Senior Analyst",
      "startDate": "2021-01",
      "endDate": "2022-07",
      "highlights": [
        "Initiated and developed deep links hiding solutions for repayment, by using TTL key-value store, prevent by token scopes.",
        "Managed as a Backend Lead in the team, and was recognized as the engineer who has strength in mentoring and consulting.",
        "Advised, consulted, and collaborated on technology terms and software architecture with cross-functional stakeholders, senior engineers, and development managers in the Java enterprise-scale banking/financial project.",
        "Suggested to Team Lead and take action to design, code, and deploy statement digitization process with Publish-Subscribe pattern with Kafka to eliminate synchronous process, cut processing time from 10 seconds to 2 seconds.",
        "Conducted training sessions to the development team about Kubernetes, microservices architecture, and cloud-native architecture including the enterprise tools with reliability and security practice, and reduced onboarding time by around 40%.",
        "Created and maintained Spring WebFlux internal libraries and architect the Java microservice templates for enterprise-scale based on development base practices. As a result, disposing of the duplication of code caused by repetition by around 30%.",
        "Migrated Kong API Gateway configuration from a manual process that takes hours to 3 minutes by creating the Bash script for automated migration working by reading a JSON configuration file and calling the RESTful configurations API.",
        "Implemented OAuth 2.0 solution by using Client Credentials and Authorization Code methods for the exchange data process for partner vendors with Kong API Gateway (CE)."
      ]
    },
    {
      "company": "Aware Technology Solutions",
      "country": "Thailand 🇹🇭",
      "position": "Software Engineer",
      "startDate": "2019-05",
      "endDate": "2020-12",
      "highlights": [
        "Focused on Kotlin Android full-stack development and delivered a software project that supports 1K+ telecommunication company's technical engineers to collect customer information about installing the internet-related.",
        "Coached new members of software engineers and instructed technologies to the team for innovative products.",
        "Researched, designed, and managed to build scalability, and reliable system for work time-attendance solution used more than hundreds of users inside corporate by Node.js microservice architecture to work with the Oracle Database.",
        "Awarded as one of \"Superstar of the company\", due to quality of software solutions delivered and business growth.",
        "Coded and implementation a Node.js expense approval system to help support the client's internal approval policy as a web application to support 2K+ employees working with PostgreSQL."
      ]
    }
  ],
  "education": [
    {
      "school": "Rajamangala University of Technology Thanyaburi",
      "degree": "Bachelor of Engineering (B.Eng.)",
      "fieldOfStudy": "Computer Engineering",
      "startDate": "2015-08",
      "endDate": "2019-03",
      "images": [
        "https://portfolio.tpcoder.dev/assets/images/cpe-bachelor-graduate.webp"
      ],
      "courses": [
        "Data structures and Algorithms",
        "Software Engineering",
        "Database System",
        "Operating System",
        "System Analysis and Design",
        "Data Communication",
        "Computer Network",
        "TCP/IP",
        "Digital Logic and Circuit",
        "Computer Organization & Assembly",
        "Computer Architect",
        "Big Data"
      ]
    }
  ]
}